quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
#ifdef AMP01V14A2




//版本说明：
//---AMP01V14A2：通讯修改为主从模式

#include "AMP01V14A2.H"

#include	"AMP_Protocol.H"

#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_TIM.H"
#include "STM32_USART.H"
#include "STM32_SPI.H"

#include "SWITCHID.H"
#include "IOT5302W.H"     //读卡器
#include "SHT20.H"				//温湿度传感器

#include 	"CRC.H"

#include "string.h"				//串和内存操作函数头文件

//------------------运行指示灯
#define ampSYSLEDPort    						GPIOA
#define ampSYSLEDPin     						GPIO_Pin_0
//------------------通讯接口--PC
#define ampCommPcPort        				USART2
#define ampCommPcBaudRate        		19200
#define ampCommPcDelayTime        	550			//每字节传输的时间us
//------------------通讯接口--柜口
#define ampCommCbPort       				USART1
#define ampCommCbTxEnPort  					GPIOA
#define ampCommCbTxEnPin   					GPIO_Pin_8
#define ampCommCbRxEnPort 					GPIOC
#define ampCommCbRxEnPin						GPIO_Pin_9
#define ampCommCbBaudRate        		19200
#define ampCommCbDelayTime        	550			//每字节传输的时间us
#define ampCommCbMaxAddr        		6				//最大地址

//------------------通讯接口--层板接口
#define ampCommLayPort     					UART4
#define ampCommLayTxEnPort 					GPIOA
#define ampCommLayTxEnPin  					GPIO_Pin_12
#define ampCommLayRxEnPort 					GPIOA
#define ampCommLayRxEnPin						GPIO_Pin_11
#define ampCommLayBaudRate        	115200
#define ampCommLayDelayTime        	550			//每字节传输的时间us
#define ampCommLayMaxAddr        		6				//最大层地址
#define ampCommSegMaxAddr        		6				//最大位地址
#define ampLayPowerOnTime        		200	//ms

//------------------层板电源控制J5、J6、J9共用一个控制电源
#define ampLayPowerPort  						GPIOB
#define ampLayPowerPin   						GPIO_Pin_2
#define ampLayPowerOn    						PB2=1
#define ampLayPowerOff   						PB2=0

//------------------通讯接口--读卡器接口
#define ampCommCardPort    					USART3
#define ampCommCardTxEnPort 				GPIOC
#define ampCommCardTxEnPin  				GPIO_Pin_8
#define ampCommCardRxEnPort 				GPIOC
#define ampCommCardRxEnPin					GPIO_Pin_7
#define ampCommCardBaudRate  				9600

//------------------锁接口J10
#define ampLockDrPort    						GPIOB
#define ampLockDrPin     						GPIO_Pin_1
#define ampLockSiPort    						GPIOC
#define ampLockSiPin     						GPIO_Pin_12
#define ampUnLock        						PB1=1
#define ampResLock       						PB1=0
#define ampGetLockSts    						PC12in
//------------------磁吸锁	PB15
#define ampMagneticLockDrPort    		GPIOB
#define ampMagneticLockDrPin     		GPIO_Pin_15
#define ampMagneticLockSiUpPort    	GPIOC
#define ampMagneticLockSiUpPin     	GPIO_Pin_14
#define ampMagneticLockSiDownPort  	GPIOC
#define ampMagneticLockSiDownPin		GPIO_Pin_13
#define ampMagneticOn        				PB15=1
#define ampMagneticOff       				PB15=0
#define ampMagneticGetLockStsUP  		PC14in   	//获取锁的状态，如果为0，表示锁已开
#define ampMagneticGetLockStsDOWN		PC13in 		//获取锁的状态，如果为0，表示锁已开
#define ampMagneticOnTime						2000			//电磁锁吸合时间--ms
//------------------背光接口J11的VCC和EN脚
#define ampBackLightPort 						GPIOB
#define ampBackLightPin  						GPIO_Pin_0
#define ampBackLighSet(Ratio)				api_pwm_oc_set_ratio(TIM3,PWM_OUTChannel3,Ratio)
#define	BackLightOnTime							310000		//5分钟+10秒
//------------------透明屏背光接口J11的VCC和EN脚
#define ampLcdLightPort 						GPIOB
#define ampLcdLightPin  						GPIO_Pin_14
#define ampLcdLightSet(Ratio)				api_pwm_oc_set_ratio(TIM1,PWM_OUTChannel2,Ratio)
#define	LcdLightOnTime							BackLightOnTime
//------------------SHT20温湿度传感器
#define ampShtSclPort 							GPIOB
#define ampShtSclPin  							GPIO_Pin_12
#define ampShtSdaPort 							GPIOB
#define ampShtSdaPin  							GPIO_Pin_13
#define	ampShtUpdataTime						1000		//更新时间ms


/* Private variables ---------------------------------------------------------*/

static RS485Def 	ampRS485Ly;   //uart4,PA15   		//层板接口
static RS485Def 	ampRS485Cb;   //usart1,PA8    	//副柜接口
static SwitchDef 	ampSwitchID;
static spi_def 		stLed;
sht20def 	sht20;

ampdef ampsys;



//----------------------------------调试数据
//unsigned char rxd[maxFramesize];



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void API_AMP01V14A2_Configuration(void)
{	
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H	
	
	Hardware_Configuration();  
	
	IWDG_Configuration(3000);		//独立看门狗配置---参数单位ms
  
  SysTick_Configuration(50);	//系统嘀嗒时钟配置72MHz,单位为uS
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void API_AMP01V14A2_Server(void)
{ 	
	AMP01V14A2_HIGH_Process();
	AMP01V14A2_LOW_Process();	
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void AMP01V14A2_HIGH_Process(void)
{
	Pc_Server();
	Cab_Server();
	Lay_Server();
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void AMP01V14A2_LOW_Process(void)
{
	static unsigned short time=0;
	if(time++<20)
		return ;
	time=0;
	
	IWDG_Feed();														//独立看门狗喂狗
	
	SysLed_server();

	test_cabinet_address_none_process();		//未拨码柜接口发LCD测试程序
	set_time_sync_frame();									//未拨码柜接口发LCD测试程序
	
	Tim_Server();
  Lock_server();
	Magnetic_Lock_server();		//磁吸锁
	SwitchID_Server();
	
  CommLed_Server();
	
	BackLight_Server();
	LcdLight_Server();	
	CardReader_Server();
	sht20_server();
	
