quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void SysLed_server(void)
{
	static unsigned short time = 0;
	//================================================有通讯，快速闪烁
	if(0!=ampsys.sysdata.SysLedFastFlag)
	{
		if(time++>100)
		{
			time=0;
			ampsys.sysdata.SysLedFastFlag=0;		//系统LED快速闪烁标志
			api_gpio_toggle(ampSYSLEDPort,ampSYSLEDPin);		//将GPIO相应管脚输出翻转----V20170605
		}
	}
	//================================================无通讯数据，1秒闪烁
	else
	{	
		if(time++>1000)
		{
			time=0;
			api_gpio_toggle(ampSYSLEDPort,ampSYSLEDPin);		//将GPIO相应管脚输出翻转----V20170605
		}
	}
}
//------------------------------------------------------------------------------


//--------------------------------static-cache_buffer
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static ampCachedef* get_cache_addr(ampPortDef port)
{
	if(NonPort	==	port)
		return 0;
	else if(PcPort	==	port)
		return ampsys.Pc.Buffer;
	else if(CabPort	==	port)
		return ampsys.Cab.Buffer;
	else if(LayPort	==	port)
		return ampsys.Lay.Buffer;
	else
		return 0;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short set_cache_data(ampPortDef port,ampphydef* frame)
{
	unsigned char 	cab_addr	=	0;	//柜地址
	unsigned char 	lay_addr	=	0;	//层地址	
	unsigned short	i=0;
	unsigned short  lastarry  = 0;
	unsigned short	len	=	0;
	unsigned char*	pBuffer	=	(unsigned char*)frame;
	ampCachedef* Cache	= get_cache_addr(port);

	if(0==Cache)	//返回空地址
		return 0;
	if(0==frame)	//
		return 0;
	
	cab_addr	=	frame->msg.addr.address1;	//柜地址
	lay_addr	=	frame->msg.addr.address2;	//层地址
	
	//-------------------------地址检查
	if((CabPort==port)&&(0x00==cab_addr))	//无柜地址
		return 0;
	if((LayPort==port)&&(0x00==lay_addr))	//无层地址
		return 0;
		
	
	//-------------------------检查数据有无溢出
	len	=	frame->msg.length+5;	//head,len,crcl.crch.end
	if(maxFramesize<len)
		return 0;
	//-------------------------检查缓存中有无相同数据及查找当前最大缓存序号
	for(i=0;i<ampArrySize;i++)
	{
		if(Cache[i].arry>lastarry)		//缓存数据不为0
		{
			lastarry	=	Cache[i].arry;	//当前最大的序号	
			if(len	==	Cache[i].size)
			{
				if(0  ==  memcmp(Cache[i].data,pBuffer,len)) //比较相同
				{
					return len;		//已有相同数据，退出，表示存储成功
				}
			}
		}
	}
	//-------------------------未在缓存中找到相同的数据
	//-------------------------判断缓存是否为满
	if(lastarry>=ampArrySize)	//从0开始
	{
		//缓存满
		return 0;
	}
	lastarry+=1;
	for(i=0;i<ampArrySize;i++)
  {
    if(0  ==  Cache[i].arry)  //0编号表示此为空缓存
    {
      memcpy(Cache[i].data,pBuffer,len);
      Cache[i].arry = lastarry;             //此缓存在发送队列中的排序
      Cache[i].size = len; 
      return  len;
    }
  }
	return 0;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static ampCachedef* get_cache_data(ampPortDef port)
{
	unsigned short	i=0;
	ampCachedef* Cache	= get_cache_addr(port);
	
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{		
		if(1==Cache[i].arry)		//缓存数据不为0
		{
			return &Cache[i];
		}
	}
	return 0;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char del_cache_data(ampPortDef port)
{
	unsigned short	i=0;
	ampCachedef* 		Cache	=	0;
	switch(port)
	{
		case PcPort:	
					ampsys.Pc.ReSendCount	=	0;
					ampsys.Pc.WaitAckFlag	=	0;
			break;
		case CabPort:	
					ampsys.Cab.ReSendCount	=	0;
					ampsys.Cab.WaitAckFlag	=	0;
			break;
		case LayPort:	
					ampsys.Lay.ReSendCount	=	0;
					ampsys.Lay.WaitAckFlag	=	0;
			break;
		default :
			break;
	}
	Cache	= get_cache_addr(port);
	
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{
		if((Cache[i].arry))
		{
			Cache[i].arry-=1;
		}
	}
	return 1;
}
//------------------------------------------------------------------------------


//--------------------------------static-ack_flag
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char get_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return 0;
	else if(PcPort	==	port)
		return ampsys.Pc.WaitAckFlag;
	else if(CabPort	==	port)
		return ampsys.Cab.WaitAckFlag;
	else if(LayPort	==	port)
		return ampsys.Lay.WaitAckFlag;
	else
		return 0;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return;
	else if(PcPort	==	port)
		ampsys.Pc.WaitAckFlag =	1;
	else if(CabPort	==	port)
		ampsys.Cab.WaitAckFlag =	1;
	else if(LayPort	==	port)
		ampsys.Lay.WaitAckFlag =	1;
	else
		return;
}



//--------------------------------static-port_server
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Pc_Server(void)
{
	pc_receive_data_process();
	pc_send_data_process();
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Cab_Server(void)
{
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	cab_receive_data_process();
	//================================================数据发送	
	cab_send_data_process();
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lay_Server(void)
{
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	lay_receive_data_process();
	lay_send_data_process();
}
//------------------------------------------------------------------------------


