quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
				ampsys.CommLed.flag.cb_tx		=	1;		//LED指示灯
				
				frame	=	(ampphydef*)Cache->data;
				//---------------------广播数据只发两次，不需要应答
				if(0xFF==frame->msg.addr.address1)
				{
					if(ampsys.Cab.ReSendCount>=2)
					{
						del_cache_data(CabPort);
					}
				}
				//---------------------查询从机命令只发一次，不需要应答
				else if(ampCmdCheckSleve==frame->msg.cmd.cmd)
				{
					del_cache_data(CabPort);
				}
				//---------------------需要等待应答
				else
				{
					set_ack_wait_flag(CabPort);
				}
			}
		}
	}
	//============================发送倒计时完成
	else if(0==ampsys.Cab.SendWaitTime)
	{
		//==========================主柜需要发送轮询消息
		if((ampsys.sysdata.MB_Flag)&&(0!=ampsys.sysdata.Cab_Addr))		//主柜
		{
			{
				ampphydef  ampframe;
				ampsys.Cab.GetSlaveAddress++;
				if(ampsys.Cab.GetSlaveAddress	==	ampsys.sysdata.Cab_Addr)
				{
					ampsys.Cab.GetSlaveAddress++;
				}
				if(ampsys.Cab.GetSlaveAddress>ampCommCbMaxAddr)
				{
					ampsys.Cab.GetSlaveAddress=1;
				}
				ampframe.head	=	headcode;
				ampframe.msg.length		=	5;
				ampframe.msg.cmd.cmd	=	ampCmdCheckSleve;
				ampframe.msg.cmd.rv		=	0;
				ampframe.msg.cmd.dir	=	1;
				ampframe.msg.addr.address1	=	ampsys.Cab.GetSlaveAddress;
				ampframe.msg.addr.address2	=	0;
				ampframe.msg.addr.address3	=	0;
				ampframe.msg.data[0]	=	0;
				api_set_frame(&ampframe,ampCmdCheckSleve,0);    //补充消息的CRC和结束符，返回帧长度
				set_cache_data(CabPort,&ampframe);		//发往其它柜
			}
		}
	}
	ampsys.Cab.SlaveSendEnable	=	0;
}
//------------------------------------------------------------------------------

/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void lay_receive_data_process(void)
{  
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	unsigned char		cmd	=	ampCmdNone;
	unsigned char		dir	=	0;
	unsigned short 	rxnum=0;
	
	ampphydef* frame;
	unsigned char 	rxd[maxFramesize];
	//============================数据接收
	rxnum	=	api_rs485_receive(&ampRS485Ly,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	//============================接收处理
	if(0!=rxnum)
	{
		frame	=	api_get_frame(rxd,rxnum);
		//--------------------------有效数据
		if(0!=frame)
		{
			ampsys.sysdata.SysLedFastFlag=1;		//系统LED快速闪烁标志
			//------------------------LED指示灯
			ampsys.CommLed.flag.ly_rx	=	1;
			cmd	=	frame->msg.cmd.cmd;
			dir	=	frame->msg.cmd.dir;
			//------------------------检查数据传输方向，层接口只接收上传
			if(0!=dir)	//下级上传消息
			{
				//----------------------检查是否为应答
				if(ampCmdAck==cmd)			//应答，删除一缓存
				{	
					//--------------------应答
					unsigned char wait_ack	=	get_ack_wait_flag(LayPort);
					if(wait_ack)
					{
						ampsys.Lay.SendWaitTime	=	2;
						del_cache_data(LayPort);
					}
				}
				//----------------------应答主柜数据转发到PC
				else
				{
					if(ampsys.sysdata.MB_Flag)	//主柜
					{
						set_cache_data(PcPort,frame);			//发往PC缓存						
					}
					else
					{
						set_cache_data(CabPort,frame);
					}
					//--------------------应答
					set_ackdown_frame(LayPort);
				}
			}
		}
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void lay_send_data_process(void)
{	
	unsigned short sendnum=0;	
	
	//============================等待层板上电
	if(0==ampsys.sysdata.LayPowerOnFlag)
		return ;
	//============================检查应答消息:立即应答
	if(ampsys.Lay.AckFrame.flag)
	{
		unsigned char* addr	=	&ampsys.Lay.AckFrame.head;
		sendnum	=	api_rs485_send_force(&ampRS485Ly,addr,ampAckSize);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
		if(sendnum)	//已将数据转移到缓存
		{	
			ampsys.sysdata.SysLedFastFlag=1;		//系统LED快速闪烁标志
			ampsys.Lay.AckFrame.flag	=	0;
			ampsys.Lay.SendWaitTime		=	2;
		}
	}
	//============================等待发送时间已到
	else if(0==ampsys.Lay.SendWaitTime)
	{
		ampCachedef*	Cache	=	get_cache_data(LayPort);
		ampphydef* frame;
		//==========================有数据
		if(0!=Cache)
		{
			//========================检查有无发送超时
			if(ampsys.Lay.ReSendCount>=ampMaxResendCount)
			{
				if(ampsys.sysdata.MB_Flag)				//主柜
				{
					set_comm_time_out_frame(PcPort,frame);
				}
				else
				{
					set_comm_time_out_frame(CabPort,frame);
				}
				del_cache_data(LayPort);
			}
			//========================发送数据
			else
			{
				//----------------------
				sendnum	=	api_rs485_send_force(&ampRS485Ly,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
				if(sendnum)	//已将数据转移到缓存
				{	
					ampsys.sysdata.SysLedFastFlag=1;		//系统LED快速闪烁标志
					frame	=	(ampphydef*)Cache->data;		
					ampsys.Lay.ReSendCount+=1;			
					ampsys.Lay.SendWaitTime	=	((sendnum+20)*ampCommLayDelayTime)/1000+2;
					
					//----------------------LED指示灯
					ampsys.CommLed.flag.ly_tx	=	1;
					
					//----------------------广播数据只发两次，不需要应答
					if((0xFF==frame->msg.addr.address2)||(0xFF==frame->msg.addr.address3))	//广播地址
					{
						if(ampsys.Lay.ReSendCount>=2)
						{
							del_cache_data(LayPort);
						}
					}
					//---------------------查询从机命令只发一次，不需要应答
					else if(ampCmdCheckSleve==frame->msg.cmd.cmd)
					{
						del_cache_data(LayPort);
					}
					//---------------------需要等待应答
					else
					{
						set_ack_wait_flag(LayPort);
					}
				}
			}
		}
		//==========================无数据待发送，发送查询指令
		else
		{			
			if(0!=ampsys.sysdata.Cab_Addr)
			{
				ampphydef  ampframe;
				static unsigned char address2=0;
				static unsigned char address3=0;
				//------------------------位地址
				if(address3++>=ampCommSegMaxAddr)
				{
					address3	=	1;
					if(address2++>=ampCommLayMaxAddr)
					{
						address2	=	1;
						address3	=	1;
					}
				}
				ampframe.head								=	headcode;
				ampframe.msg.length					=	5;
				ampframe.msg.cmd.cmd				=	ampCmdCheckSleve;
				ampframe.msg.cmd.rv					=	0;
				ampframe.msg.cmd.dir				=	1;
				ampframe.msg.addr.address1	=	ampsys.sysdata.Cab_Addr;
				ampframe.msg.addr.address2	=	address2;
				ampframe.msg.addr.address3	=	address3;
				ampframe.msg.data[0]				=	0;
				api_set_frame(&ampframe,ampCmdCheckSleve,0);    //补充消息的CRC和结束符，返回帧长度
				set_cache_data(LayPort,&ampframe);		//发往其它柜
			}			
		}
	}	
}
//------------------------------------------------------------------------------


