quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void cmd_process(ampphydef* frame)
{	
	if(0!=frame)
	{	
		unsigned char	cab_addr	=	0;	//柜地址
		unsigned char cmd				=	0;
		unsigned char parameter	=	0;
		cmd	=	frame->msg.cmd.cmd;
		cab_addr		=	frame->msg.addr.address1;		//柜地址
		parameter		=	frame->msg.data[0];					//如果是控制类消息时的请求标志
		
		if((0xFF==cab_addr)||(cab_addr==ampsys.sysdata.Cab_Addr))	//地址
		{
			//------------------------------与层板供电相关的命令1
			if((ampCmdLcdConf == cmd)||(ampCmdLcdData==cmd))       //LCD配置命令
			{
				set_layer_power(1);
			}
			
			//------------------------------与层板供电相关的命令2
			if((ampCmdLed==cmd)||(ampCmdLcdPwr==cmd)||(ampCmdPwr==cmd))  //LED电源供电控制指令
			{
				set_layer_power(parameter);
			}
			
			//------------------------------与背光相关的命令
			if((ampCmdBKligth==cmd))  //LED电源供电控制指令
			{
				set_backlight(parameter);
			}

			//------------------------------与开门相关的命令
			if(ampCmdLock ==  cmd)   //锁控制命令
			{
				set_door(parameter);
			}
			//------------------------------查询命令
			else if(ampCmdSta ==  cmd)   //查询状态
			{
				set_lock_status_frame();
			}
			//ampsys.BackLight.flag.Level=3;
			//ampsys.LcdLight.flag.Level=3;
		}
	}
}
//------------------------------------------------------------------------------


//--------------------------------static-hardware_control
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_door(unsigned char flag)
{
	//flag不为0表示有请求
	if(0==flag)
	{
		ampsys.Lock.LockTime		=	0;	//开锁时间2秒
		ampResLock;
	}
	else
	{
		ampsys.Lock.LockTime					=	ampUnlockOuttime;	//开锁时间2秒
		ampUnLock;
	}
}
//------------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 0-关闭，1-打开
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_layer_power(unsigned char flag)
{
	//flag不为0表示有请求
	if(0==flag)
	{
		ampLayPowerOff;
		ampsys.sysdata.LayPowerOnFlag	=	0;
		ampsys.time.LayPowerOnTime		=	0;		
	}
	else
	{
		ampLayPowerOn;
		if(0==ampsys.time.LayPowerOnTime)
			ampsys.time.LayPowerOnTime		=	ampLayPowerOnTime;
	}	
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	LockStatusUpdata
*功能描述		:	上报锁状态
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_backlight(unsigned char flag)
{
	//============================柜门打开时不受指令控制
	if(0==ampsys.Lock.flag.LockStatus)
	{
	}
	//============================柜门关闭时可受控
	else
	{
		//--------------------------亮背光
		if(flag)
		{
			ampsys.BackLight.flag.SetLevel	=	3;
			ampsys.LcdLight.flag.SetLevel		=	3;
		}
		//--------------------------关背光
		else
		{
			ampsys.BackLight.flag.SetLevel	=	1;
			ampsys.LcdLight.flag.SetLevel		=	1;
		}
	}
	
}
//------------------------------------------------------------------------------




//--------------------------------static-set_frame
/*******************************************************************************
*函数名			:	getframe
*功能描述		:	获取帧地址，返回帧长度
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_ackup_frame(ampPortDef Port)
{  
	ampphydef*	frame;

	ampAckDef* ack  = 0;
	if(PcPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Pc.AckFrame;
	else if(CabPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Cab.AckFrame;
	else if(LayPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Lay.AckFrame;
	else
		return ;	

	frame=(ampphydef*)ack;
	
	ack->head	=	headcode;
	ack->length	=	5;
	ack->cmd.cmd	=	ampCmdAck;
	ack->cmd.rv		=	0;
	ack->cmd.dir	=	1;
	ack->address1	=	ampsys.sysdata.Cab_Addr;		//向上应答为柜地址
	ack->address2	=	0;
	ack->address3	=	0;
	ack->status=0;
	
	api_set_frame(frame,ampCmdAck,1);    //补充消息的CRC和结束符，返回帧长度
	
	ack->flag		=	1;
}
/*******************************************************************************
*函数名			:	getframe
*功能描述		:	获取帧地址，返回帧长度
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_ackdown_frame(ampPortDef Port)
{  
  ampphydef*	frame;

	ampAckDef* ack  = 0;
	if(PcPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Pc.AckFrame;
	else if(CabPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Cab.AckFrame;
	else if(LayPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Lay.AckFrame;
	else
		return;	

	frame=(ampphydef*)ack;
	
	frame->head	=	headcode;
	frame->msg.length	=	5;
	frame->msg.cmd.cmd	=	ampCmdAck;
	frame->msg.cmd.rv		=	0;
	frame->msg.cmd.dir	=	0;
	frame->msg.addr.address1	=	0x00;		//向下应答无地址
	frame->msg.addr.address2	=	0;
	frame->msg.addr.address3	=	0;
	frame->msg.data[0]=0;

	api_set_frame(frame,ampCmdAck,0);    //补充消息的CRC和结束符，返回帧长度
	
	ack->flag		=	1;
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_lock_status_frame(void)
{
	ampphydef	frame;
	frame.head	=	headcode;
	frame.msg.length	=	6;		//cmd,addr1,addr2,addr3,data0,data1
	frame.msg.cmd.cmd	=	ampCmdLock;
	frame.msg.cmd.rv	=	0;
	frame.msg.cmd.dir	=	1;
	frame.msg.addr.address1	=	ampsys.sysdata.Cab_Addr;
	frame.msg.addr.address2	=	0;
	frame.msg.addr.address3	=	0;
	frame.msg.data[0]	=	ampStypeLock;
	frame.msg.data[1]	=	ampsys.Lock.flag.LockStatus;
	
	api_set_frame(&frame,ampCmdLock,ampDirUp);		//设置消息帧
	
