quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
	if(ampsys.sysdata.MB_Flag)	//主板
		set_cache_data(PcPort,&frame);
	else
		set_cache_data(CabPort,&frame);
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	LockStatusUpdata
*功能描述		:	上报锁状态
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_comm_time_out_frame(ampPortDef Port,ampphydef* frame)
{
//  unsigned char databuffer[32]={0};
//  unsigned short framlength = 0;  //生成的消息长度
//  unsigned short datalength = 2;  //需要上报的数据字节数
  ampphydef  ampframe;
	
	ampframe.head	=	headcode;
	ampframe.msg.length		=	6;
	ampframe.msg.cmd.cmd	=	ampCmdSta;
	ampframe.msg.cmd.rv		=	0;
	ampframe.msg.cmd.dir	=	1;
	ampframe.msg.addr.address1	=	frame->msg.addr.address1;
	ampframe.msg.addr.address2	=	frame->msg.addr.address2;
	ampframe.msg.addr.address3	=	frame->msg.addr.address3;
	ampframe.msg.data[0]	=	ampStypeComm;
	ampframe.msg.data[1]	=	AmpCommTimeOut;
	
  switch(Port)
  {
    case  NonPort   : return ;   //不继续执行
    case  PcPort    : break;    //PC接口发送缓存
    case  CabPort   ://柜接口发送缓存
                      ampframe.msg.addr.address2 = 0;
                      ampframe.msg.addr.address3 = 0;
      break;
    case  LayPort   ://层接口发送缓存
      break;
    case  CardPort  ://读卡器接口发送缓存
      break;
    default :return;      //不继续执行 
  }
	api_set_frame(&ampframe,ampCmdSta,1);
	set_cache_data(Port,&ampframe);
}
//------------------------------------------------------------------------------







//--------------------------------static-Server
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void SwitchID_Server(void)                              
{
  static unsigned char id=0;
  static unsigned char power_on_flag=0; //上电时为0

	if(0!=ampsys.time.swicthidtime)
		return;
	ampsys.time.swicthidtime	=	2000;
  if(0==power_on_flag)  //刚上电
  {
    power_on_flag = 1;  //已上电完成
    id  = api_get_SwitchId_data_left(&ampSwitchID);
		if(id&0x80)
			ampsys.sysdata.MB_Flag	=	1;
		else
			ampsys.sysdata.MB_Flag	=	0;
		
		//------透明屏标志
		if(id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
  }
  else
  {
		unsigned char new_id  = 0;
		new_id  = api_get_SwitchId_data_left(&ampSwitchID);
		if(id != new_id)  //重新初始化
		{
			ampsys.sysdata.Cab_Addr	=	new_id&0x3F;	

			if(new_id&0x80)
				ampsys.sysdata.MB_Flag	=	1;
			else
				ampsys.sysdata.MB_Flag	=	0;
			//------透明屏标志
		if(new_id&0x40)
			ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		else
			ampsys.sysdata.Display_Flag	=	0;	//透明屏标志://0--普通/无屏，1--主柜透明屏
		
//			power_on_flag = 0;
			id = new_id;
		}
		
  }
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lock_server(void)
{
	//==========================未拨码:背光闪烁
	if(0==ampsys.sysdata.Cab_Addr)
	{
		if(ampGetLockSts)			//锁未打开
		{
			ampUnLock;
			ampsys.Lock.LockTime=ampUnlockOuttime;
		}
		else
		{
			if(ampsys.Lock.LockTime>0)
			{
				ampsys.Lock.LockTime--;
			}
			else
			{
				ampResLock;
			}
		}
		ampsys.sysdata.PowerOn_Flag=0;
	}
	//==========================正常驱动
	else
	{
		if(ampsys.Lock.LockTime>0)
		{
			if(ampsys.Lock.LockTime<ampUnlockOuttime-100)
			{
				if(ampGetLockSts)			//锁未打开
				{
					ampUnLock;
				}
				else if(ampsys.Lock.LockTime>200)
				{
					ampsys.Lock.LockTime	=	200-1;	//延迟500ms释放锁
				}
			}
			else
			{
				ampUnLock;
			}
		}
		//============================
		else
		{
			ampResLock;
			//--------------------------门状态--关闭
			if(ampGetLockSts)
			{
				if(0==ampsys.Lock.flag.LockStatus)	//原来为开门状态
				{
					set_layer_power(0);				//关层板电源
					ampsys.Lock.flag.LockUpdata	=	1;
				}
				else
				{
					ampsys.Lock.flag.LockUpdata	=	0;
				}			
				ampsys.Lock.flag.LockStatus	=	1;
			}
			//--------------------------门状态--打开
			else
			{
				if(0!=ampsys.Lock.flag.LockStatus)	//原来为关门状态
				{
					ampsys.Lock.flag.LockUpdata	=	1;
				}
				else
				{
					ampsys.Lock.flag.LockUpdata	=	0;
				}
				ampsys.Lock.flag.LockStatus	=	0;
			}
			//--------------------------门状态更新:上报给PC
			if(0!=ampsys.Lock.flag.LockUpdata)
			{
				if(ampsys.sysdata.PowerOn_Flag)
				{
					set_lock_status_frame();	//上报关门消息
				}
			}
		}
		ampsys.sysdata.PowerOn_Flag=1;
	}
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	Magnetic_Lock_server
*功能描述		:	磁吸锁
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Magnetic_Lock_server(void)
{
	//==========================未拨码:背光闪烁
	if(0==ampsys.sysdata.Cab_Addr)
	{
		ampMagneticOff;
		//ampsys.MagneticLock.LockTime=0;
	}
	//==========================锁状态有变化
	else if(ampsys.Lock.flag.LockUpdata)
	{
		//------------------------开门:释放磁吸锁	
		if(1==ampsys.Lock.flag.LockStatus)
		{
			ampMagneticOn;
		}
		else
		{			
			ampMagneticOff;
		}
	}
	//==========================等待一定时间后释放锁

}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void CommLed_Server(void)
{
	unsigned char displaycode	=	0;

	//==========================V3	
	if(ampsys.CommLed.FlashTime++>50)
	{
		ampsys.CommLed.FlashTime=0;
		//========================Setp1:根据标志初始化闪烁次数
		//------------------------PC端口
		if(ampsys.CommLed.flag.pc_tx)
		{
			ampsys.CommLed.flag.pc_tx	=	0;
			ampsys.CommLed.time.pc_tx	=	ampledtime;
		}
		if(ampsys.CommLed.flag.pc_rx)
		{
			ampsys.CommLed.flag.pc_rx	=	0;
			ampsys.CommLed.time.pc_rx	=	ampledtime;
		}
		//------------------------柜端口
		if(ampsys.CommLed.flag.cb_tx)
		{
			ampsys.CommLed.flag.cb_tx	=	0;
			ampsys.CommLed.time.cb_tx	=	ampledtime;
		}
		if(ampsys.CommLed.flag.cb_rx)
		{
			ampsys.CommLed.flag.cb_rx	=	0;
			ampsys.CommLed.time.cb_rx	=	ampledtime;
		}
		//------------------------层端口
		if(ampsys.CommLed.flag.ly_tx)
		{
			ampsys.CommLed.flag.ly_tx	=	0;
			ampsys.CommLed.time.ly_tx	=	ampledtime;
		}
		if(ampsys.CommLed.flag.ly_rx)
		{
			ampsys.CommLed.flag.ly_rx	=	0;
			ampsys.CommLed.time.ly_rx	=	ampledtime;
		}
		//------------------------读卡器端口
		if(ampsys.CommLed.flag.rf_tx)
		{
			ampsys.CommLed.flag.rf_tx	=	0;
			ampsys.CommLed.time.rf_tx	=	ampledtime;
		}
		if(ampsys.CommLed.flag.rf_rx)
		{
			ampsys.CommLed.flag.rf_rx	=	0;
			ampsys.CommLed.time.rf_rx	=	ampledtime;
		}
		//========================Setp2:根据闪烁次数设置显示标志
		//------------------------需要点亮
		if(0==ampsys.CommLed.ClearFlag)
		{
			ampsys.CommLed.ClearFlag=1;
			ampsys.CommLed.displaycode.code	=	0xFF;
			//----------------------PC接口
			if(ampsys.CommLed.time.pc_tx>0)
			{
				ampsys.CommLed.time.pc_tx-=1;
				ampsys.CommLed.displaycode.seg.pc_tx=0;
			}
			//----------------------柜接口
			if(ampsys.CommLed.time.cb_tx>0)
			{
				ampsys.CommLed.time.cb_tx-=1;
				ampsys.CommLed.displaycode.seg.cb_tx=0;
			}
			//----------------------层接口
			if(ampsys.CommLed.time.ly_tx>0)
			{
				ampsys.CommLed.time.ly_tx-=1;
				ampsys.CommLed.displaycode.seg.ly_tx=0;
			}
			//----------------------读卡器
			if(ampsys.CommLed.time.rf_tx>0)
			{
				ampsys.CommLed.time.rf_tx-=1;
				ampsys.CommLed.displaycode.seg.rf_tx=0;
			}
		}
		else
		{
			ampsys.CommLed.ClearFlag=0;			
			ampsys.CommLed.displaycode.code	=	0xFF;
			//----------------------PC接口
			if(ampsys.CommLed.time.pc_rx>0)
			{
				ampsys.CommLed.time.pc_rx-=1;
				ampsys.CommLed.displaycode.seg.pc_rx=0;
			}
			//----------------------柜接口
			if(ampsys.CommLed.time.cb_rx>0)
			{
				ampsys.CommLed.time.cb_rx-=1;
				ampsys.CommLed.displaycode.seg.cb_rx=0;
			}
			//----------------------层接口
			if(ampsys.CommLed.time.ly_rx>0)
			{
				ampsys.CommLed.time.ly_rx-=1;
				ampsys.CommLed.displaycode.seg.ly_rx=0;
			}
			//----------------------读卡器
			if(ampsys.CommLed.time.rf_rx>0)
			{
				ampsys.CommLed.time.rf_rx-=1;
				ampsys.CommLed.displaycode.seg.rf_rx=0;
			}
		}		
		//========================发送数据
		displaycode	=	ampsys.CommLed.displaycode.code;
		spi_set_nss_low(&stLed);
		SPI_I2S_SendData(stLed.port.SPIx, displaycode);				//发送数据
		spi_set_nss_high(&stLed);
	}

