quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A2.C
}
//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void sht20_server(void)
{
	api_sht20_server();
	if(0==ampsys.SHT20.Time)
	{
		ampphydef	frame;
		
		ampsys.SHT20.Time	=	ampShtUpdataTime;
		
		ampsys.SHT20.temperature		=	api_sht20_get_temperature();
		ampsys.SHT20.humidity				=	api_sht20_get_humidity();		
		
		ampsys.SHT20.SegTemperature	=	api_sht20_get_SegTemperature();
		ampsys.SHT20.SegHumidity		=	api_sht20_get_SegHumidity();
		
		if((0!=ampsys.SHT20.SegTemperature)&&(0!=ampsys.SHT20.SegHumidity))
		{
			frame.head							=	headcode;
			frame.msg.length				=	8;		//cmd,addr1,addr2,addr3,data0,data1,data2,data3
			frame.msg.cmd.cmd				=	ampCmdTHdata;
			frame.msg.cmd.rv				=	0;
			frame.msg.cmd.dir				=	1;
			frame.msg.addr.address1	=	ampsys.sysdata.Cab_Addr;
			frame.msg.addr.address2	=	0;
			frame.msg.addr.address3	=	0;
			frame.msg.data[0]				=	ampsys.SHT20.SegTemperature&0xFF;
			frame.msg.data[1]				=	(ampsys.SHT20.SegTemperature>>8)&0xFF;
			
			frame.msg.data[2]				=	ampsys.SHT20.SegHumidity&0xFF;
			frame.msg.data[3]				=	(ampsys.SHT20.SegHumidity>>8)&0xFF;			
			
			api_set_frame(&frame,ampCmdTHdata,ampDirUp);		//设置消息帧
			
			if(ampsys.sysdata.MB_Flag)	//主板
				set_cache_data(PcPort,&frame);
			else
				set_cache_data(CabPort,&frame);
		}		
	}
}
//------------------------------------------------------------------------------








//--------------------------------static-configuration
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Hardware_Configuration(void)
{
  BackLight_Configuration();
	LayPower_Configuration();
	Lock_Configuration();
  SwitchID_Configuration();
  Led_Configuration();
  Communication_Configuration();
	sht20_configuration();
	GPIO_Configuration_OPP50(ampSYSLEDPort,ampSYSLEDPin);
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Communication_Configuration(void)
{
	IOT5302Wdef ampIOT5302W;
  //-----------------------------PC接口USART1
  //api_usart_dma_configurationNR(ampCommPcPort,19200,maxFramesize);	//USART_DMA配置--查询方式，不开中断
	api_usart_configuration_NR(ampCommPcPort,ampCommPcBaudRate,maxFramesize);	//USART_DMA配置--查询方式，不开中断
  
  //-----------------------------读卡器接口USART3
  ampIOT5302W.Conf.IOT5302WPort.USARTx  = ampCommCardPort;
	ampIOT5302W.Conf.IOT5302WPort.RS485_TxEn_PORT	= ampCommCardTxEnPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_TxEn_Pin	= ampCommCardTxEnPin;
	ampIOT5302W.Conf.IOT5302WPort.RS485_RxEn_PORT	= ampCommCardRxEnPort;
  ampIOT5302W.Conf.IOT5302WPort.RS485_RxEn_Pin	= ampCommCardRxEnPin;
	//ampIOT5302W.Conf.IOT5302WPort.RS485_CTL_PORT	=	ampCommCardRxEnPort;
	//ampIOT5302W.Conf.IOT5302WPort.RS485_CTL_Pin		=	ampCommCardRxEnPin;
  ampIOT5302W.Conf.USART_BaudRate  = ampCommCardBaudRate;
  api_iot5302w_configuration(&ampIOT5302W);
	
  //-----------------------------层板接口USART2
  ampRS485Ly.USARTx  = ampCommLayPort;
  ampRS485Ly.RS485_TxEn_PORT  = ampCommLayTxEnPort;
  ampRS485Ly.RS485_TxEn_Pin   = ampCommLayTxEnPin;
	ampRS485Ly.RS485_RxEn_PORT	=	ampCommLayRxEnPort;
	ampRS485Ly.RS485_RxEn_Pin		=	ampCommLayRxEnPin;
  api_rs485_configuration_NR(&ampRS485Ly,ampCommLayBaudRate,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
	
  //-----------------------------副柜接口UART4
  ampRS485Cb.USARTx  					=	ampCommCbPort;
	ampRS485Cb.RS485_TxEn_PORT	=	ampCommCbTxEnPort;
	ampRS485Cb.RS485_TxEn_Pin		=	ampCommCbTxEnPin;
	ampRS485Cb.RS485_RxEn_PORT	=	ampCommCbRxEnPort;
	ampRS485Cb.RS485_RxEn_Pin		=	ampCommCbRxEnPin;
	api_rs485_configuration_NR(&ampRS485Cb,ampCommCbBaudRate,maxFramesize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
}
//------------------------------------------------------------------------------

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void SwitchID_Configuration(void)
{
  ampSwitchID.NumOfSW	=	8;
  
  ampSwitchID.SW1_PORT	=	GPIOB;
  ampSwitchID.SW1_Pin	=	GPIO_Pin_9;
  
  ampSwitchID.SW2_PORT	=	GPIOB;
  ampSwitchID.SW2_Pin	=	GPIO_Pin_8;
  
  ampSwitchID.SW3_PORT	=	GPIOB;
  ampSwitchID.SW3_Pin	=	GPIO_Pin_7;
  
  ampSwitchID.SW4_PORT	=	GPIOB;
  ampSwitchID.SW4_Pin	=	GPIO_Pin_6;
  
  ampSwitchID.SW5_PORT	=	GPIOB;
  ampSwitchID.SW5_Pin	=	GPIO_Pin_5;
  
  ampSwitchID.SW6_PORT	=	GPIOB;
  ampSwitchID.SW6_Pin	=	GPIO_Pin_4;
  
  ampSwitchID.SW7_PORT	=	GPIOB;
  ampSwitchID.SW7_Pin	=	GPIO_Pin_3;
  
  ampSwitchID.SW8_PORT	=	GPIOD;
  ampSwitchID.SW8_Pin	=	GPIO_Pin_2;

	api_SwitchId_initialize(&ampSwitchID);						//

  ampsys.sysdata.Cab_Addr  = api_get_SwitchId_data_left(&ampSwitchID)&0x3F;  
  
	//------主柜标志
  if(api_get_SwitchId_data_left(&ampSwitchID)&0x80)
  {
    ampsys.sysdata.MB_Flag=1; //0--副柜，1--主柜
  }
  else
  {
    ampsys.sysdata.MB_Flag=0; //0--副柜，1--主柜
  }
	//------透明屏标志
	if(api_get_SwitchId_data_left(&ampSwitchID)&0x40)
  {
    ampsys.sysdata.Display_Flag=1; //透明屏标志://0--普通/无屏，1--主柜透明屏
  }
  else
  {
    ampsys.sysdata.Display_Flag=0; //透明屏标志://0--普通/无屏，1--主柜透明屏
  }
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void BackLight_Configuration(void)
{
  GPIO_Configuration_OPP50(ampBackLightPort,ampBackLightPin);
	GPIO_Configuration_OPP50(ampLcdLightPort,ampLcdLightPin);
	ampsys.BackLight.flag.SetLevel=3;
	ampsys.LcdLight.flag.SetLevel=3;
	//PWM_OUTN(TIM1,PWM_OUTChannel2,500,0);	//亮
	api_pwm_oc_configurationN(TIM1,PWM_OUTChannel2,1000,500);			//LCD背光
	api_pwm_oc_configuration(TIM3,PWM_OUTChannel3,1000,500);			//柜体背光
  //ampBakkLightOff;
}
//------------------------------------------------------------------------------

